Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://10.0.2.2:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Baseline Load Test (100 VUs)"
    - duration: 60
      arrivalRate: 100
      name: "Sustained Baseline"
    - duration: 30
      arrivalRate: 200
      name: "Stress Test (200 VUs)"
scenarios:
  - name: "Browse Careers and Domains"
    flow:
      - get:
          url: "/api/careers"
      - get:
          url: "/api/domains/traditional"
      - get:
          url: "/api/domains/non-traditional"
